In [1]:
import pandas as pd

df = pd.read_excel("product.xlsx")
df

,Id,Product_name,Origin,cost,Brand,unnamed_col,model,entry_date,Amazon,Flipkart
0,p1,Laptop,china,289000,Lenovo,1,L1-1997,01-Jan-2025,0,1
1,p2,mobile,US,100$,Oppo F11,1,M1-2015,03-DEC-2025,0,1
2,p3,tablet,china,89000,SAMgsung,1,"t12,2000",16-08-2025,1,0
3,p4,Laptop,India,NaN,APPLE,1,L1-2017,18-11-2015,1,1
4,p5,head phones,US,10$,BOAT,1,H3:2022,4-4-2025,0,1
5,p6,Laptop,India,275000,LENovo,1,L3:2015,3/10/2025,1,0
6,p2,mobile,US,100$,Oppo F11,1,M1-2015,03-DEC-2025,0,1
7,p7,NaN,chiNa,3000,Vivo,1,H2-2000,4-4-2025,0,1

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            8 non-null      object
 1   Product_name  7 non-null      object
 2   Origin        8 non-null      object
 3   cost          7 non-null      object
 4   Brand         8 non-null      object
 5   unnamed_col   8 non-null      int64
 6   model         8 non-null      object
 7   entry_date    8 non-null      object
 8   Amazon        8 non-null      int64
 9   Flipkart      8 non-null      int64
dtypes: int64(3), object(7)
memory usage: 772.0+ bytes

In [3]:
df.duplicated().any()

np.True_

In [4]:
df = df.drop_duplicates(keep="first")
df

,Id,Product_name,Origin,cost,Brand,unnamed_col,model,entry_date,Amazon,Flipkart
0,p1,Laptop,china,289000,Lenovo,1,L1-1997,01-Jan-2025,0,1
1,p2,mobile,US,100$,Oppo F11,1,M1-2015,03-DEC-2025,0,1
2,p3,tablet,china,89000,SAMgsung,1,"t12,2000",16-08-2025,1,0
3,p4,Laptop,India,NaN,APPLE,1,L1-2017,18-11-2015,1,1
4,p5,head phones,US,10$,BOAT,1,H3:2022,4-4-2025,0,1
5,p6,Laptop,India,275000,LENovo,1,L3:2015,3/10/2025,1,0
7,p7,NaN,chiNa,3000,Vivo,1,H2-2000,4-4-2025,0,1

In [5]:
df['Product_name'] = df['Product_name'].fillna("Unknown")
df

C:\Users\Suraj Kumar\AppData\Local\Temp\ipykernel_8460\3215374760.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Product_name'] = df['Product_name'].fillna("Unknown")

,Id,Product_name,Origin,cost,Brand,unnamed_col,model,entry_date,Amazon,Flipkart
0,p1,Laptop,china,289000,Lenovo,1,L1-1997,01-Jan-2025,0,1
1,p2,mobile,US,100$,Oppo F11,1,M1-2015,03-DEC-2025,0,1
2,p3,tablet,china,89000,SAMgsung,1,"t12,2000",16-08-2025,1,0
3,p4,Laptop,India,NaN,APPLE,1,L1-2017,18-11-2015,1,1
4,p5,head phones,US,10$,BOAT,1,H3:2022,4-4-2025,0,1
5,p6,Laptop,India,275000,LENovo,1,L3:2015,3/10/2025,1,0
7,p7,Unknown,chiNa,3000,Vivo,1,H2-2000,4-4-2025,0,1

In [6]:
df['cost'] = df['cost'].fillna("Unknown")
df

C:\Users\Suraj Kumar\AppData\Local\Temp\ipykernel_8460\3312709291.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['cost'] = df['cost'].fillna("Unknown")

,Id,Product_name,Origin,cost,Brand,unnamed_col,model,entry_date,Amazon,Flipkart
0,p1,Laptop,china,289000,Lenovo,1,L1-1997,01-Jan-2025,0,1
1,p2,mobile,US,100$,Oppo F11,1,M1-2015,03-DEC-2025,0,1
2,p3,tablet,china,89000,SAMgsung,1,"t12,2000",16-08-2025,1,0
3,p4,Laptop,India,Unknown,APPLE,1,L1-2017,18-11-2015,1,1
4,p5,head phones,US,10$,BOAT,1,H3:2022,4-4-2025,0,1
5,p6,Laptop,India,275000,LENovo,1,L3:2015,3/10/2025,1,0
7,p7,Unknown,chiNa,3000,Vivo,1,H2-2000,4-4-2025,0,1

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 0 to 7
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            7 non-null      object
 1   Product_name  7 non-null      object
 2   Origin        7 non-null      object
 3   cost          7 non-null      object
 4   Brand         7 non-null      object
 5   unnamed_col   7 non-null      int64
 6   model         7 non-null      object
 7   entry_date    7 non-null      object
 8   Amazon        7 non-null      int64
 9   Flipkart      7 non-null      int64
dtypes: int64(3), object(7)
memory usage: 616.0+ bytes

In [8]:
df['cost'] = df['cost'].astype('string')
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 0 to 7
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            7 non-null      object
 1   Product_name  7 non-null      object
 2   Origin        7 non-null      object
 3   cost          7 non-null      string
 4   Brand         7 non-null      object
 5   unnamed_col   7 non-null      int64
 6   model         7 non-null      object
 7   entry_date    7 non-null      object
 8   Amazon        7 non-null      int64
 9   Flipkart      7 non-null      int64
dtypes: int64(3), object(6), string(1)
memory usage: 616.0+ bytes

C:\Users\Suraj Kumar\AppData\Local\Temp\ipykernel_8460\3457355516.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['cost'] = df['cost'].astype('string')

In [9]:
df

,Id,Product_name,Origin,cost,Brand,unnamed_col,model,entry_date,Amazon,Flipkart
0,p1,Laptop,china,289000,Lenovo,1,L1-1997,01-Jan-2025,0,1
1,p2,mobile,US,100$,Oppo F11,1,M1-2015,03-DEC-2025,0,1
2,p3,tablet,china,89000,SAMgsung,1,"t12,2000",16-08-2025,1,0
3,p4,Laptop,India,Unknown,APPLE,1,L1-2017,18-11-2015,1,1
4,p5,head phones,US,10$,BOAT,1,H3:2022,4-4-2025,0,1
5,p6,Laptop,India,275000,LENovo,1,L3:2015,3/10/2025,1,0
7,p7,Unknown,chiNa,3000,Vivo,1,H2-2000,4-4-2025,0,1

In [10]:
# def cost_correction(row):
#     if row['cost'] in '$':
#         return row['cost'].str.split("$")[0]
#     else:
#         return row['cost']
    
# df.apply(cost_correction, axis=1)

# df['cost'].str.split("$")[0]
# df.loc[df['cost'] in "$"]

In [11]:
df = df.drop(columns=["unnamed_col"])
df

,Id,Product_name,Origin,cost,Brand,model,entry_date,Amazon,Flipkart
0,p1,Laptop,china,289000,Lenovo,L1-1997,01-Jan-2025,0,1
1,p2,mobile,US,100$,Oppo F11,M1-2015,03-DEC-2025,0,1
2,p3,tablet,china,89000,SAMgsung,"t12,2000",16-08-2025,1,0
3,p4,Laptop,India,Unknown,APPLE,L1-2017,18-11-2015,1,1
4,p5,head phones,US,10$,BOAT,H3:2022,4-4-2025,0,1
5,p6,Laptop,India,275000,LENovo,L3:2015,3/10/2025,1,0
7,p7,Unknown,chiNa,3000,Vivo,H2-2000,4-4-2025,0,1

In [12]:
df = df.rename(columns={"Product_name": "Product Name", "cost": "Cost", "model": "Model", "entry_date": "Entry Date"})
df

,Id,Product Name,Origin,Cost,Brand,Model,Entry Date,Amazon,Flipkart
0,p1,Laptop,china,289000,Lenovo,L1-1997,01-Jan-2025,0,1
1,p2,mobile,US,100$,Oppo F11,M1-2015,03-DEC-2025,0,1
2,p3,tablet,china,89000,SAMgsung,"t12,2000",16-08-2025,1,0
3,p4,Laptop,India,Unknown,APPLE,L1-2017,18-11-2015,1,1
4,p5,head phones,US,10$,BOAT,H3:2022,4-4-2025,0,1
5,p6,Laptop,India,275000,LENovo,L3:2015,3/10/2025,1,0
7,p7,Unknown,chiNa,3000,Vivo,H2-2000,4-4-2025,0,1

In [13]:
df['Brand'] = df['Brand'].str.title()
df['Origin'] = df['Origin'].str.title()
df['Product Name'] = df['Product Name'].str.title()
df

,Id,Product Name,Origin,Cost,Brand,Model,Entry Date,Amazon,Flipkart
0,p1,Laptop,China,289000,Lenovo,L1-1997,01-Jan-2025,0,1
1,p2,Mobile,Us,100$,Oppo F11,M1-2015,03-DEC-2025,0,1
2,p3,Tablet,China,89000,Samgsung,"t12,2000",16-08-2025,1,0
3,p4,Laptop,India,Unknown,Apple,L1-2017,18-11-2015,1,1
4,p5,Head Phones,Us,10$,Boat,H3:2022,4-4-2025,0,1
5,p6,Laptop,India,275000,Lenovo,L3:2015,3/10/2025,1,0
7,p7,Unknown,China,3000,Vivo,H2-2000,4-4-2025,0,1

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 0 to 7
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            7 non-null      object
 1   Product Name  7 non-null      object
 2   Origin        7 non-null      object
 3   Cost          7 non-null      string
 4   Brand         7 non-null      object
 5   Model         7 non-null      object
 6   Entry Date    7 non-null      object
 7   Amazon        7 non-null      int64
 8   Flipkart      7 non-null      int64
dtypes: int64(2), object(6), string(1)
memory usage: 560.0+ bytes

In [15]:
df['Cost_inr'] = (
    df['Cost']
    .astype(str)
    .str.replace('$', '', regex=False)
    .str.replace(',', '', regex=False)
)
df['Cost_inr'] = pd.to_numeric(df['Cost_inr'], errors="coerce")
df.loc[df['Cost'].astype(str).str.contains('$', regex=False), 'Cost_inr'] *= 89
df
# df.info()

,Id,Product Name,Origin,Cost,Brand,Model,Entry Date,Amazon,Flipkart,Cost_inr
0,p1,Laptop,China,289000,Lenovo,L1-1997,01-Jan-2025,0,1,289000.0
1,p2,Mobile,Us,100$,Oppo F11,M1-2015,03-DEC-2025,0,1,8900.0
2,p3,Tablet,China,89000,Samgsung,"t12,2000",16-08-2025,1,0,89000.0
3,p4,Laptop,India,Unknown,Apple,L1-2017,18-11-2015,1,1,NaN
4,p5,Head Phones,Us,10$,Boat,H3:2022,4-4-2025,0,1,890.0
5,p6,Laptop,India,275000,Lenovo,L3:2015,3/10/2025,1,0,275000.0
7,p7,Unknown,China,3000,Vivo,H2-2000,4-4-2025,0,1,3000.0

In [16]:
df = df.drop(columns=("Cost"))
df

,Id,Product Name,Origin,Brand,Model,Entry Date,Amazon,Flipkart,Cost_inr
0,p1,Laptop,China,Lenovo,L1-1997,01-Jan-2025,0,1,289000.0
1,p2,Mobile,Us,Oppo F11,M1-2015,03-DEC-2025,0,1,8900.0
2,p3,Tablet,China,Samgsung,"t12,2000",16-08-2025,1,0,89000.0
3,p4,Laptop,India,Apple,L1-2017,18-11-2015,1,1,NaN
4,p5,Head Phones,Us,Boat,H3:2022,4-4-2025,0,1,890.0
5,p6,Laptop,India,Lenovo,L3:2015,3/10/2025,1,0,275000.0
7,p7,Unknown,China,Vivo,H2-2000,4-4-2025,0,1,3000.0

In [17]:
df['Cost_inr'] = df['Cost_inr'].fillna(df['Cost_inr'].median())
df

,Id,Product Name,Origin,Brand,Model,Entry Date,Amazon,Flipkart,Cost_inr
0,p1,Laptop,China,Lenovo,L1-1997,01-Jan-2025,0,1,289000.0
1,p2,Mobile,Us,Oppo F11,M1-2015,03-DEC-2025,0,1,8900.0
2,p3,Tablet,China,Samgsung,"t12,2000",16-08-2025,1,0,89000.0
3,p4,Laptop,India,Apple,L1-2017,18-11-2015,1,1,48950.0
4,p5,Head Phones,Us,Boat,H3:2022,4-4-2025,0,1,890.0
5,p6,Laptop,India,Lenovo,L3:2015,3/10/2025,1,0,275000.0
7,p7,Unknown,China,Vivo,H2-2000,4-4-2025,0,1,3000.0

In [18]:
df['Entry Date'] = df['Entry Date'].astype('datetime64[ms]')
df

,Id,Product Name,Origin,Brand,Model,Entry Date,Amazon,Flipkart,Cost_inr
0,p1,Laptop,China,Lenovo,L1-1997,2025-01-01,0,1,289000.0
1,p2,Mobile,Us,Oppo F11,M1-2015,2025-12-03,0,1,8900.0
2,p3,Tablet,China,Samgsung,"t12,2000",2025-08-16,1,0,89000.0
3,p4,Laptop,India,Apple,L1-2017,2015-11-18,1,1,48950.0
4,p5,Head Phones,Us,Boat,H3:2022,2025-04-04,0,1,890.0
5,p6,Laptop,India,Lenovo,L3:2015,2025-03-10,1,0,275000.0
7,p7,Unknown,China,Vivo,H2-2000,2025-04-04,0,1,3000.0

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 0 to 7
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            7 non-null      object
 1   Product Name  7 non-null      object
 2   Origin        7 non-null      object
 3   Brand         7 non-null      object
 4   Model         7 non-null      object
 5   Entry Date    7 non-null      datetime64[ms]
 6   Amazon        7 non-null      int64
 7   Flipkart      7 non-null      int64
 8   Cost_inr      7 non-null      float64
dtypes: datetime64[ms](1), float64(1), int64(2), object(5)
memory usage: 560.0+ bytes

In [20]:
df['Model'] = df['Model'].str.replace(",", "-")
df['Model'] = df['Model'].str.replace(":", "-")
df

,Id,Product Name,Origin,Brand,Model,Entry Date,Amazon,Flipkart,Cost_inr
0,p1,Laptop,China,Lenovo,L1-1997,2025-01-01,0,1,289000.0
1,p2,Mobile,Us,Oppo F11,M1-2015,2025-12-03,0,1,8900.0
2,p3,Tablet,China,Samgsung,t12-2000,2025-08-16,1,0,89000.0
3,p4,Laptop,India,Apple,L1-2017,2015-11-18,1,1,48950.0
4,p5,Head Phones,Us,Boat,H3-2022,2025-04-04,0,1,890.0
5,p6,Laptop,India,Lenovo,L3-2015,2025-03-10,1,0,275000.0
7,p7,Unknown,China,Vivo,H2-2000,2025-04-04,0,1,3000.0

In [21]:
df['Model'] = df['Model'].str.title()
df['Id'] = df['Id'].str.upper()
df

,Id,Product Name,Origin,Brand,Model,Entry Date,Amazon,Flipkart,Cost_inr
0,P1,Laptop,China,Lenovo,L1-1997,2025-01-01,0,1,289000.0
1,P2,Mobile,Us,Oppo F11,M1-2015,2025-12-03,0,1,8900.0
2,P3,Tablet,China,Samgsung,T12-2000,2025-08-16,1,0,89000.0
3,P4,Laptop,India,Apple,L1-2017,2015-11-18,1,1,48950.0
4,P5,Head Phones,Us,Boat,H3-2022,2025-04-04,0,1,890.0
5,P6,Laptop,India,Lenovo,L3-2015,2025-03-10,1,0,275000.0
7,P7,Unknown,China,Vivo,H2-2000,2025-04-04,0,1,3000.0

In [22]:
df[["Model No", "Model"]] = df['Model'].str.split("-", expand=True)
df

,Id,Product Name,Origin,Brand,Model,Entry Date,Amazon,Flipkart,Cost_inr,Model No
0,P1,Laptop,China,Lenovo,1997,2025-01-01,0,1,289000.0,L1
1,P2,Mobile,Us,Oppo F11,2015,2025-12-03,0,1,8900.0,M1
2,P3,Tablet,China,Samgsung,2000,2025-08-16,1,0,89000.0,T12
3,P4,Laptop,India,Apple,2017,2015-11-18,1,1,48950.0,L1
4,P5,Head Phones,Us,Boat,2022,2025-04-04,0,1,890.0,H3
5,P6,Laptop,India,Lenovo,2015,2025-03-10,1,0,275000.0,L3
7,P7,Unknown,China,Vivo,2000,2025-04-04,0,1,3000.0,H2